cf_billing/InformationRegisters/бестСрокиИсполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСрокиИсполненияЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПроверкаКомплектаДокументов</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПодготовкаПроектаДоговора</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеДокументаРуководителю</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеПротоколаРазногласийЮристам</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособПолученияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыПолученияЗаявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаличиеЭкспертногоЗаключения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСрокиИсполненияЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерефейс

Функция ПолучитьСрокИсполнения(ТочкаМаршрутаБизнесПроцесса,СпособПолученияЗаявки,НаличиеЭкспертногоЗаключения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСрокиИсполненияЗадач.Дни КАК Дни
		|ИЗ
		|	РегистрСведений.бестСрокиИсполненияЗадач КАК бестСрокиИсполненияЗадач
		|ГДЕ
		|	бестСрокиИсполненияЗадач.ТочкаМаршрута = &ТочкаМаршрута
		|	И бестСрокиИсполненияЗадач.СпособПолученияЗаявки = &СпособПолученияЗаявки
		|	И бестСрокиИсполненияЗадач.НаличиеЭкспертногоЗаключения = &НаличиеЭкспертногоЗаключения";
	
	Запрос.УстановитьПараметр("НаличиеЭкспертногоЗаключения", 	НаличиеЭкспертногоЗаключения);
	Запрос.УстановитьПараметр("СпособПолученияЗаявки", 			СпособПолученияЗаявки);
	Запрос.УстановитьПараметр("ТочкаМаршрута", 					ТочкаМаршрутаБизнесПроцесса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Дни;		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
